#Область ОбработчикиЭлементовФормы

// Процедура - обработка начала выбора файла
//
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Файл журнала регистрации 1С (*.lgp)|*.lgp";
	Диалог.Заголовок = "Журнал регистрации 1С";

	ЗавершениеВыбораФайла = Новый ОписаниеОповещения("ПутьКФайлуНачалоВыбораЗавершение", ЭтаФорма);
	
	Диалог.Показать(ЗавершениеВыбораФайла);
	
КонецПроцедуры // ПутьКФайлуНачалоВыбора()

// Процедура - продолжение обработки выбора файла
//
&НаКлиенте
Процедура ПутьКФайлуНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если НЕ ТипЗнч(ВыбранныеФайлы) = Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеФайлы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПутьКФайлу = ВыбранныеФайлы[0];
	
КонецПроцедуры // ПутьКФайлуНачалоВыбораЗавершение()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "Прочитать"
//
&НаСервере
Функция ПрочитатьНаСервере(ПутьКФайлу)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	ОбработкаОбъект.Прочитать(ПутьКФайлу);
	
	Возврат ОбработкаОбъект.ПолучитьРезультат(Истина);
	
КонецФункции // ПрочитатьНаСервере()

// Процедура - обработчик команды "Прочитать"
//
&НаКлиенте
Процедура Прочитать(Команда)
	
	Результат = ПрочитатьНаСервере(ПутьКФайлу);
	
КонецПроцедуры // Прочитать()

#КонецОбласти
